; TaskSwitchXP Pro 2.0.11
; ENG: Finnish Language File / FIN: Suomenkielen käännöstiedosto
; ENG: Translated by / FIN: Kääntänyt Oskari Lavinto <http://www.olavinto.net/, oskari.lavinto@gmail.com>

19999="Finnish (Suomi)"

; Cofiguration
20000="TaskSwitchXP Pro"
20001="OK"
20002="Peruuta"
20003="Käytä"

; Filters
20031="TaskSwitchXP Pro asetukset (*.cfg)"

; Pages
20050="Yleiset"
20051="Ulkoasu"
20052="Tehtävälista"
20053="Esikatselu"
20054="Valittu tehtävä"
20055="Pikanäppäimet"
20056="Säännöt"
20057="Kehittyneet"
20058="Tietoja"

; Page descriptions
20070="Yleiset asetukset"
20071="Ulkoasun asetukset"
20072="Tehtävälistan asetukset"
20073="Esikatselun asetukset"
20074="Valitun tehtävän asetukset"
20075="Pikanäppäinten hallinta"
20076="Sääntöjen hallinta"
20077="Kehittyneet asetukset"
20078="Tietoja ohjelmasta..."


; General page
20100="Käyttöliittymän kieli:"
20101="<a id=\"idLang\" href=\"\">Hae lisää käännöksiä...</a>"
20102="Käytä omia asetuksia Windowsin jokaiselle käyttäjälle"
20103="Käynnistä TaskSwitchXP Windowsin käynnistyksen yhteydessä"
20104="Aseta TaskSwitchXP:lle korkea prioriteetti"
20105="Tarkista onko Microsoft PowerToy TaskSwitcher käytössä"
20106="Tehtäväpalkin tarjottimen kuvakkeet:"
20107="Näytä TaskSwitchXP:n kuvake tarjottimella"
20108="Käytä omaa kuvaketta:"
20109="Hiiren oikea näppäin pienentää minkä tahansa ikkunan tarjottimelle"
20110="Estä Windows XP:tä piilottamasta TaskSwitch XP Pron kuvakkeita"
20111="Lisää tarjottimelle pienennetyt ikkunat tehtävälistan loppuun"

20120="Palauta oletukset"
20121="Lataa..."
20122="Tallenna..."

; Appearance page
20200="Tehtävälistan sijainti näytöllä:"
20201="Näytä aktiivisessa näytössä"
20202="Näytä tehtävälistan varjo"
20203="Tee tehtävälistasta läpinäkyvä:"
20204="Animoi tehtävälistan avaus (millisekuntteina):"
20205="Animoi tehtävälistan sulku (millisekuntteina):"
20206="Ulkoasun tyyli"
20207="Kun käytetään Windows XP:n visuaalista tyyliä:"
20208="Kun käytetään Windowsin klassista tyyliä:"
20209="Käytä aina Windowsin klassista tyyliä"
20210="Näytä tehtävän esikatselu tehtävälistan oikealla puolella"

; Position on screen
20270="Ylhäällä - Vasemmalla"
20271="Ylhäällä - Keskellä"
20272="Ylhäällä - Oikealla"
20273="Keskellä - Vasemmalla"
20274="Keskellä näyttöä"
20275="Keskellä - Oikealla"
20276="Alhaalla - Vasemalla"
20277="Alhaalla - Keskellä"
20278="Alhaalla - Oikealla"

; Modern XP skins
20280="Käynnistä-valikon tyyli (oletus)"
20281="Microsoft PowerToy TaskSwitcherin tyyli"
20282="Yksinkertainen ikkunan tyyli"
20283="Tasainen XP tyyli"
20284="Pehmeä XP tyyli"
20285="Tehtäväpalkin tyyli"

; Classical skins
20290="Käynnistä-valikon tyyli (oletus)"
20291="Tasainen tehtäväpalkin tyyli"


; Task List page
20300="Tehtävälistan ulkoasu:"
20301="Sarakkeiden määrä:"
20302="Leveys (kuvapisteinä):"
20303="Rivien määrä:"
20304="Näytä pienet kuvakkeet"
20305="Näytä työkaluvihjeet"
20306="Näytä tehtävää osoitettaessa käsi-tyylinen hiiren kursori"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Valitse tehtävä osoittamalla"
20308="Vaihda hiiren rullan pyörimissuunta"
20309="Aktiivis(t)en valintojen taustan tyyli:"
20310="Windows-tyylinen valintakehys"
20311="Värit ja tekstin tyyli:"
20312="Kirjasin:"
20313="Koko:"
20314="B"
20315="I"
20316="Värit:"

; List views
20390="Näytä vain kuvakkeet"
20391="Näytä myös teksti"

; Selection styles
20380="Vain kehys"
20381="Täytetty"
20382="Täytetty, pyöreät kulmat"

; Color indexes
20370="Normaali, ei aktiivinen teksti"
20371="Normaali valinta - Teksti"
20372="Normaali valinta - Tausta"
20373="Useita valintoja - Teksti 1"
20374="Useita valintoja - Tausta 1"
20375="Useita valintoja - Teksti 2"
20376="Useita valintoja - Tausta 2"


; Preview page
20400="Esikatselun tyyli:"
20401="Näytä koko työpöytä"
20402="Näytä vain valittu tehtävä"
20403="Näytä myös Windowsin tehtäväpalkki"
20404="Jos useita, näytä vain tehtävän viimeisin aktiivisena ollut ikkuna"
20405="Näytä vain aktiivinen ikkuna, ei muuta työpöytää (v1.0 tyyli)"
20406="Näytä työpöydän taustakuva"
20407="Näytä kuvan kehys"
20408="Keskitä kuva pystysuorassa"
20409="Näytä pienennetyn ikkunan otsikkopalkki kuvakkeen sijasta (*)"
20410="Älä näytä esikatselua läpinäkyville kohteille (*)"
20411="Kuvan leveys (kuvapisteinä):"
20412="Viive ennen kuvan kaappausta (millisekuntteina):"
20413="Älä tallenna kuvaa välimuistiin"
20414="Kuvan automaattinen päivitys (millisekuntteina):"


; Info page
20500="Otsikon ulkoasu (tehtävälistan ylälaita):"
20501="Kirjasin:"
20502="Koko:"
20503="B"
20504="I"
20505="Väri:"
20506="Näytä tekstin varjo:"
20507="Syvyys:"
20508="Väri:"
20509="Näytä tehtävän kuvake otsikon edessä"
20510="Näytä pieni kuvake ja matala otsikkopalkki"
20511="Tehtävän tiedot (tehtävälistan alalaita):"
20512="Kirjasin:"
20513="Koko:"
20514="B"
20515="I"
20516="Väri:"
20517="Näytä tekstin varjo:"
20518="Syvyys:"
20519="Väri:"
20520="Korkeus:"
20521="Sisällön tyyppi:"

; Info formats
20590="Ei mitään (tyhjä palkki)"
20591="Vain tehtävän sijainti listassa"
20592="Prosessin tunnus (PID)"
20593="Prosessin nimi"
20594="Prosessin nimi ja tunnus (PID)"
20595="Prosessin kuvaus"


; Hotkeys page
20600="Korvaa Windowsin normaali tehtävänvalitsin (Alt-Tab)"
20601="Näytä instanssilista Ctrl+Alt+Shift+Tab -näppäimillä"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Älä sulje tehtävälistaa kun yllämainitut pikanäppäimet vapautetaan"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Korvaa Windowsin normaali tehtävänvalitsin vaihtoehtoisella tavalla"
20604="Yleiset hallintanäppäimet:"
20605="Tehtävälista (pysyy auki):"
20606="Instanssilista (pysyy auki):"
20607="Asetusten hallintatyökalu:"
20608="Näytä/piilota tarjottimen kuvake:"
20609="Sulje TaskSwitchXP Pro:"
20610="Muut pikanäppäimet:"
20611="Pienennä ikkuna tarjottimelle:"
20612="Palauta pienennetty ikkuna:"


; Exclusions page
20700="Uusi..."
20701="Muokkaa..."
20702="Poista"

; List groups
20780="Tehtävät, joille ei luoda esikatselua"
20781="Tehtävät, joita ei näytetä lainkaan"

20790="Nimi"
20791="Määritykset"

; Advanced page
20800="Tehtävien otsikot tehtävälistassa:"
20801="Käytä tehtävän pää-ikkunan otsikkoa"
20802="Valitun tehtävän ulkoasu:"
20803="Älä näytä tehtävän otsikkoa (poistaa yläreunan palkin)"
20804="Älä näytä tehtävän tietoja (poistaa alareunan palkin)"
20805="Hiiren näppäinten määritykset tehtäväpalkin kuvakkeelle:"
20806="Valikko:"
20807="Asetusten hallintatyökalu:"
20808="Tehtävälista:"
20809="Instanssilista:"
20810="Asetusten hallintatyökalun asetukset:"
20811="Näytä ikkuna aina päällimmäisenä"
20812="Muista ikkunan aikaisempi sijainti näytöllä"
20813="Muista viimeksi avoimena ollut asetussivu"
20814="Käynnistä TaskSwitchXP Pro kun työkalu avataan tai suljetaan"

; Tray icon actions
20890="Näppäintä ei määritetty"
20891="Vasen näppäin"
20892="Vasen näppäin (X2)"
20893="Keskimmäinen näppäin"
20894="Keskimmäinen näppäin (X2)"
20895="Oikea näppäin"
20896="Oikea näppäin (X2)"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="TaskSwitchXP Pron suomenkielen käännöksestä vastaa Oskari Lavinto.\r\nLähetä <a id=\"idTranslatorMail\" href=\"mailto:oskari.lavinto@gmail.com?Subject=TaskSwitchXP Pro\">palautetta</a> ja vieraile <a id=\"idTranslatorHome\" href=\"http://olavinto.no-ip.org\">kotisivuillani</a>. Käännös on versiolle 2.0.9 (v1.2)."


; Exclusions dialog
22000="Säännön luonti/muokkaus"
22001="OK"
22002="Peruuta"
22003="Avoimet prosessit:"
22004="Päivitä lista"
22005="Säännön nimi:"
22006="Määritykset:"
22007="Prosessin nimi:"
22008="Ikkunan luokka:"
22009="Ikkunan otsikko:"
22010="Rajoitukset:"
22011="Tehtävälle ei luoda esikatselua"
22012="Tehtävää ei näytetä lainkaan"
22013="Käytä tätä sääntöä"

22090="" ; not excluded
22091=">> Tehtävälle ei luoda esikatselua"
22092=">> Tehtävää ei näytetä lainkaan"

; Configurator Errors
30000="TaskSwitchXP Pron hallintatyökalun virhe"
30002="TaskSwitchXP.exe -sovellusta ei voitu käynnistää! Tarkista TaskSwitchXP Pron asennuksen kunto."
30003="Asetuksia ei voitu tallentaa rekisteriin. Tarkista kirjoitusoikeutesi."
30004="Asetusten luku tiedostosta ei onnistunut."
30005="Asetusten luku tiedostosta ei onnistunut. Oletusasetukset on palautettu."
30006="Asetusten tallennus tiedostoon ei onnistunut."

; Hints for exclusion dialog
30100="Virhe!"
30101="Anna säännölle nimi."
30102="Virhe!"
30103="Määritä tehtävän tiedot."
30104="Virhe!"
30105="Määritä prosessin nimi."
30106="Virhe!"
30107="Määritä ikkunan luokka."

; Confirmations
30900="TaskSwitchXP vahvistus"
30901="TaskSwitchXP on tunnistanut enemmän kuin yhden aktiivisen näyttölaitteen.\r\nHaluatko näyttää kaikki esikatselut toissijaisella näytöllä?"


; TaskSwitchXP Language Strings

; Tray menu
31000="Tehtävälista"
31001="Instanssilista"
31002="Asetukset..."
31003="Sulje"

31020="Pika-asetukset"
31021="Piilota tehtäväpalkin kuvake"
31022="Korvaa Windowsin Alt-Tab tehtävänvalitsin"
31023="Käytä instanssilistaa"
31024="Jätä ikkuna auki kun näppäimet vapautetaan"
31025="Käytä vaihtoehtoista toimitilaa"
31026="Lisää uusi sääntö..."

31050="Ohjeita"
31051="Ohje"
31052="Kotisivu"
31053="Tietoja ohjelmasta..."

; Tray menu for minimized applications
31090="TSXP: %d sovellus(ta)"
31091="Palauta kaikki"
31092="Pienennä kaikki"
31093="Sulje kaikki"
31094="Palauta"
31095="Pienennä"
31096="Sulje"

; Task List menu
31110="Aktivoi"
31111="Pienennä"
31112="Pienennä kuvakkeeksi"
31113="Limittäin"
31114="Allekkain"
31115="Vierekkäin"
31116="Palauta"
31117="Suurenna"
31118="Sulje"
31119="Lopeta prosessi"

; Common menu
31150="Näytä prosessin tiedot"
31151="Valitse kaikki"
31152="Poista valinnat"
31153="Poista valitut"
31154="Järjestä otsikon mukaan"
31155="Järjestä sovelluksen mukaan"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Kuvan nimi:  %s\r\nProsessitunnus (PID):  %u\r\n\r\nKäyntiaika:  %u:%02u:%02u\r\nSuoritinaika:  %u:%02u:%02u\r\n\r\nMuistin käyttö:  %uK\r\nVM Size:  %uK"
31501=Prosessin tietoja ei ole saatavilla...

; Confirmations
31900="TaskSwitchXP Pro vahvistus"
31901="TaskSwitchXP Pro on jo käunnissä. Haluatko sulkea sen?"
31902="Oletko varma, että haluat sulkea TaskSwitchXP Pron?"
31903="TaskSwitchXP Pro on tunnistanut, että Microsoft PowerToy TaskSwitcher on käynnissä.\r\nHaluatko sulkea sen?"

; Errors
32000="TaskSwitchXP Pro virhe"
32002="Alustus epäonnistui."
32003="Vaihtoehtoista toimitilaa ei voitu ottaa käyttöön."
32004="Pikanäppäintä Alt+Tab tai Alt+Shift+Tab ei voinut rekisteröidä.\r\nJokin toinen avoin sovellus on jo rekisteröinyt sen."
32005="Pikanäppäintä Ctrl+Alt+Tab tai Ctrl+Alt+Shift+Tab ei voinut rekisteröidä.\r\nJokin toinen avoin sovellus on jo rekisteröinyt sen."
32006="ConfigTsXP.exe -sovellusta ei voitu käynnistää! Tarkista TaskSwitchXP Pron asennuksen kunto."

32500="Pikanäppäimen rekisteröinti ei onnistunut:\r\n\r\nNimi: %s\r\nMuuttujat: %02X\r\nVirtuaalinen koodi: %02X"
32501="Sulje TaskSwitchXP Pro"
32502="Näytä/Piilota tehtäväpalkin kuvake"
32503="TaskSwitchXP Pron asetukset"
32504="Tehtävänvalitsin"
32505="Instanssinvalitsin"
32506="Pienennä ikkuna kuvakkeeksi"
32507="Palauta kuvakkeesta"
